tap 'bramstein/webfonttools'
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'


#
# Comment or uncomment if you want to adapt your installation
#

# OSX Terminal stuff that will make your life easier
brew 'bash'
brew 'coreutils'
brew 'curl'
brew 'git'
brew 'git-lfs'
brew 'n'
brew 'trash'
brew 'wget'


#
# system tools
#

cask 'osxfuse'
# let you mount windows drives and write on it

cask '1password'
# maintain your passwords

cask 'appcleaner'
# remove apps with system setting files

cask 'hyper'
# nicer terminal

cask 'monolingual'
# tool to remove unused languages for your mac

cask 'recordit'
# record a part of the screen as gif

cask 'rightfont'
# good font management for osx

cask 'fontstand'
# try expensive fonts for 1h

cask 'spectacle'
# rearrange your OSX windows with shortcuts

cask 'the-unarchiver'
# better Unarchiver for OSX (supports more formats but works the same)

# extends quicklook so it supports more formats
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'


#
# Text & Code
#

mas 'Xcode', id: 497799835
# OSX Coding tools and IOS Simulators

cask 'phpstorm'
# most powerful ide for php and other programming languages

cask 'docker'
cask 'kitematic'
# host for local development

#
# Internet stuff
#

cask 'google-chrome'
# best browser hands down

cask 'firefox'
# alternative for google chrome

cask 'opera'
# only used for testing websites

mas 'Transmit', id: 403388562
# ftp

cask 'citrix-receiver'
# citrix receiver


#
# Collaboration & communication
#

cask 'gitter'
cask 'teamviewer'
cask 'joinme'
cask 'slack'
cask 'skype'
cask 'sourcetree'
# git UI

# MS Office & OpenOffice
cask 'microsoft-office'
cask 'openoffice'

#
# Creative stuff & image tools
#

cask 'imagealpha'
# create small transparent PNG

cask 'imageoptim'
# PNG optimization

# adobe stuff
cask 'adobe-acrobat-pro'
cask 'adobe-creative-cloud'


#
# Multimedia & Tools
#

cask 'gifrocket'
# create gif's from movies
